/**
 * Copyright(c) 2004-2017, farsight Ltd. All rights reserved.
 * File Name : layout_client.c
 * Author    : jfe <jingfeih@foxmail.com>
 * Create    : 2017-01-13
 * Purpose   : Stuff MIS UI
 */

#include <layout_client.h>


static int clear_screen(void)
{
    int ret;
    
    ret = system("clear");
    if (ret < 0){
        return -1;
    }
    return 0;
}


void layout_main(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 主页 |-----------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|                     1.登录            2.退出                        |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_user(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 普通用户 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|              1.查询信息     2.修改信息      3.注销                  |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_user_update_detail(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 修改信息 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|          1.用户名       2.密码       3.姓名                         |");
    puts("|          4.地址         5.年龄       6.电话        7.返回           |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 超级用户 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|    1.查询信息   2.修改信息   3.添加用户   4.删除用户   5.注销       |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin_quary(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 查询信息 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|                     1.输入用户名        2.返回                      |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin_update(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 修改信息 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|                     1.输入用户名        2.返回                      |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin_update_detail(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 修改信息 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|      1.权限    2.用户名    3.密码    4.姓名    5.地址               |");
    puts("|      6.年龄    7.等级      8.工号    9.电话   10.工资   11.返回     |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin_insert(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 添加用户 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|                     1.输入用户名        2.返回                      |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


void layout_admin_delete(void)
{
    clear_screen();
    puts("+------------------------| 员工信息管理系统 |-------------------------+");
    puts("+--| 删除用户 |-------------------------------------------------------+");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("|                     1.输入用户名        2.返回                      |");
    puts("|                                                                     |");
    puts("|                                                                     |");
    puts("+---------------------------------------------------------------------+");
    printf("input>> ");
    fflush(stdout);
}


